{
    "listingDescription": "asbplayer es un asistente para el aprendizaje de idiomas, desarrollado para aquellos que estudian su idioma objetivo mediante contenido subtitulado.\n\nA diferencia de otras extensiones similares como Language Reactor, asbplayer es completamente gratuito, código abierto y compatible con casi todos los servicios de streaming de video.\n\nUsando asbplayer, puedes mejorar cualquier elemento de video con:\n\n- Subtítulos con texto seleccionable. Puedes usar tus propios archivos de subtítulos o usar subtítulos detectados automáticamente en servicios de streaming populares como Netflix y Youtube.\n- Interfaz y controles para crear tarjetas de Anki de alta calidad con subtítulos, capturas de pantalla y audio.\n- Interfaz y controles para navegar entre subtítulos, activar y desactivar pistas, cambiar la velocidad de reproducción de video, entre otros.\n- Modos de reproducción especiales que permiten, por ejemplo, saltar secciones de video sin subtitular para optimizar tu aprendizaje.",
    "firefoxAndroidListingDescription": "asbplayer es un asistente para el aprendizaje de idiomas, desarrollado para aquellos que estudian su idioma objetivo mediante contenido subtitulado.\n\nA diferencia de otras extensiones similares como Language Reactor, asbplayer es completamente gratuito, código abierto y compatible con casi todos los servicios de streaming de video.\n\nUsando asbplayer, puedes mejorar cualquier elemento de video con:\n\n- Subtítulos con texto seleccionable. Puedes usar tus propios archivos de subtítulos o usar subtítulos detectados automáticamente en servicios de streaming populares como Netflix y Youtube.\n- Interfaz y controles para crear tarjetas de Anki de alta calidad con subtítulos, capturas de pantalla y audio.\n\nAdvertencia: La versión de asbplayer para Firefox Android posee una cantidad de funciones limitadas comparada con la versión para Chromium. En particular, no hay panel lateral, soporte para grabación de audio protegido por DRM ni atajos de teclado."
}