{
    "listingDescription": "asbplayer est un assistant d’apprentissage des langues, conçu pour les apprenants sérieux qui étudient leur langue cible à travers des médias sous-titrés.\n\nContrairement à des extensions similaires comme Language Reactor, asbplayer est entièrement gratuit, open source et compatible avec quasiment tous les services de vidéo en streaming existants.\n\nAvec asbplayer, vous pouvez enrichir n’importe quel élément vidéo en streaming avec :\n\n- Des sous-titres sélectionnables. Vous pouvez importer vos propres fichiers de sous-titres ou utiliser les sous-titres auto-détectés sur des plateformes populaires comme Netflix et YouTube.\n- Une interface et des contrôles pour créer des flashcards Anki de haute qualité, incluant sous-titres, captures d’écran et pistes audio.\n- Une interface et des commandes pour naviguer entre les sous-titres, activer/désactiver les sous-titres, modifier la vitesse de lecture de la vidéo, et bien plus encore.\n- Des modes de lecture spéciaux qui, par exemple, sautent toutes les sections sans sous-titres afin d’optimiser votre apprentissage.",
    "firefoxAndroidListingDescription": "asbplayer est un assistant d’apprentissage des langues, conçu pour les apprenants sérieux qui étudient leur langue cible à travers des médias sous-titrés.\n\nContrairement à des extensions similaires comme Language Reactor, asbplayer est entièrement gratuit, open source et compatible avec quasiment tous les services de vidéo en streaming existants.\n\nAvec asbplayer, vous pouvez enrichir n’importe quel élément vidéo en streaming avec :\n\n- Des sous-titres sélectionnables. Vous pouvez importer vos propres fichiers de sous-titres ou utiliser les sous-titres auto-détectés sur des plateformes populaires comme Netflix et YouTube.  \n- Une interface pour créer des flashcards Anki de haute qualité, incluant sous-titres, captures d’écran et pistes audio.  \n\n**Attention :** la version Firefox pour Android d’asbplayer offre un ensemble de fonctionnalités limité par rapport à la version Chromium ; notamment, il n’y a pas de panneau latéral, pas de prise en charge de l’enregistrement audio protégé par DRM, et pas de raccourcis clavier."
}