{
    "listingDescription": "asbplayer adalah asisten pembelajaran bahasa yang dikembangkan untuk para pembelajar bahasa serius yang mempelajari bahasa target mereka melalui media dengan teks takarir.\n\nBerbeda dengan ekstensi serupa seperti Language Reactor, asbplayer sepenuhnya gratis, bersifat sumber terbuka, dan kompatibel dengan hampir semua layanan video streaming yang tersedia.\n\nDengan menggunakan asbplayer, Anda dapat menyempurnakan elemen video streaming apa pun melalui fitur-fitur berikut:\n\n- Takarir dengan teks yang dapat dipilih. Anda dapat menggunakan berkas takarir sendiri, atau menggunakan takarir yang terdeteksi secara otomatis pada layanan streaming populer seperti Netflix dan YouTube.\n- Antarmuka dan kontrol untuk membuat kartu Anki berkualitas tinggi yang menyertakan takarir, tangkapan layar, dan audio.\n- Antarmuka dan kontrol untuk menavigasi antar takarir, mengaktifkan atau menonaktifkan takarir, mengubah kecepatan pemutaran video, dan lainnya.\n- Mode pemutaran khusus yang, misalnya, melewati seluruh bagian video yang tidak memiliki takarir guna mengoptimalkan proses pembelajaran Anda.",
    "firefoxAndroidListingDescription": "asbplayer adalah asisten pembelajaran bahasa yang dikembangkan bagi para pembelajar bahasa serius yang mempelajari bahasa target mereka melalui media dengan teks takarir.\n\nBerbeda dengan ekstensi serupa seperti Language Reactor, asbplayer sepenuhnya gratis, bersifat sumber terbuka, dan kompatibel dengan hampir semua layanan video streaming yang tersedia.\n\nDengan menggunakan asbplayer, Anda dapat meningkatkan elemen video streaming apa pun melalui:\n\n- Takarir dengan teks yang dapat dipilih. Anda dapat menggunakan berkas takarir sendiri, atau menggunakan takarir yang terdeteksi secara otomatis pada layanan streaming populer seperti Netflix dan YouTube.\n- Antarmuka untuk membuat kartu Anki berkualitas tinggi yang menyertakan takarir, tangkapan layar, dan audio.\n\nPeringatan: Versi asbplayer untuk Firefox di Android memiliki fitur yang lebih terbatas dibandingkan dengan versi untuk Chromium. Secara khusus, tidak tersedia panel samping, tidak mendukung perekaman audio yang dilindungi DRM, dan tidak mendukung pintasan keyboard."
}