{
    "listingDescription": "asbplayer jest asystentem do nauki języków, stworzonym dla poważnie podchodzących do nauki osób, które uczą się docelowego języka przy pomocy mediów z napisami.\n\nW przeciwieństwie do podobnych wtyczek, tj. Language Reactor, asbplayer jest całkowicie darmowym, otwartym oprogramowaniem, kompatybilnym z prawie wszystkimi istniejącymi serwisami streamingowymi.\n\nUżywając asbplayera, możesz rozbudować każdy odtwarzacz streamowanego wideo o funkcje:\n\n- Napisy z możliwością zaznaczania tekstu. Możesz załadować swoje własne napisy lub użyć automatycznie wykrytych napisów w popularnych serwisach streamingowych, tj. Netflix i YouTube.\n- Interfejs to tworzenia wysokiej jakości fiszek do Anki - z napisami, zrzutami ekranu i audio.\n- Interfejs do nawigowania między kwestiami, włączania i wyłączania napisów, zmiany prędkości odtarzania wideo i wiele więcej.\n- Specjalne tryby odtwarzania, np. pomijania wszystkich sekcji wideo bez napisów, aby zoptymalizować naukę.",
    "firefoxAndroidListingDescription": "asbplayer jest asystentem do nauki języków, stworzonym dla poważnie podchodzących do nauki osób, które uczą się docelowego języka przy pomocy mediów z napisami.\n\nW przeciwieństwie do podobnych wtyczek, tj. Language Reactor, asbplayer jest całkowicie darmowym, otwartym oprogramowaniem, kompatybilnym z prawie wszystkimi istniejącymi serwisami streamingowymi.\n\nUżywając asbplayera, możesz rozbudować każdy odtwarzacz streamowanego wideo o funkcje:\n\n- Napisy z możliwością zaznaczania tekstu. Możesz załadować swoje własne napisy lub użyć automatycznie wykrytych napisów w popularnych serwisach streamingowych, tj. Netflix i YouTube.\n- Interfejs to tworzenia wysokiej jakości fiszek do Anki - z napisami, zrzutami ekranu i audio.\n\nUwaga: Wersje asbplayera na Firefox'a i Androida mają limitowany zestaw funkcji w porównaniu wersją na Chromium. Z istotnych różnic brakuje panelu bocznego, nie ma wsparcia dla nagrywania audio chronionego przez DRM i nie ma skrótów klawiszowych."
}