{
    "listingDescription": "O asbplayer é um assistente de aprendizado de idiomas, desenvolvidos para estudantes de línguas sérios que aprendem seus idiomas através de mídias com legenda.\n\nDiferentemente de outras extensões parecidas como o Language Reactor, o asbplayer é completamente gratuito, de código fonte aberto e compatível com praticamente todo serviço de streaming de vídeo que existe.\n\nUtilizando o asbplayer, você pode apprimorar qualquer elemento de vídeo streaming com:\n\n- Legendas selecionáveis de texto: Você pode subir seus próprios arquivos de legenda, ou usar legendas detectadas automaticamente em serviços de streaming populares como a Netflix e o YouTube.\n- Interface de usuários e controles para criar flashcards no Anki de alta qualidade e com legendas, capturas de tela e áudios.\n- Interface e controles para navegar pelas legendas, ativar e desativar legendas, mudar a velocidade de reprodução do vídeo, e muito mais.\n- Modos de reprodução especiais que, por exemplo, pulam todas as seções sem legenda do vídeo para otimizar seu aprendizado.",
    "firefoxAndroidListingDescription": "O asbplayer é um assistente de aprendizado de idiomas, desenvolvidos para estudantes de línguas sérios que aprendem seus idiomas através de mídias com legenda.\n\nDiferentemente de outras extensões parecidas como o Language Reactor, o asbplayer é completamente gratuito, de código fonte aberto e compatível com praticamente todo serviço de streaming de vídeo que existe.\n\nUtilizando o asbplayer, você pode aprimorar qualquer elemento de vídeo streaming com:\n\n- Legendas selecionáveis de texto: Você pode subir seus próprios arquivos de legenda, ou usar legendas detectadas automaticamente em serviços de streaming populares como a Netflix e o YouTube.\n- Interface de usuário e controles para criar flashcards no Anki de alta qualidade e com legendas, capturas de tela e áudios.\n\nAviso: A versão para Firefox no Android possui um conjunto de funcionalidades limitado se comparado à versão Chromium. Notavelmente não há painel lateral, nenhum suporte para gravar áudio protegido por DRM, e nenhum atalho de teclado."
}