{
    "common": {
        "action.cancel": "Button to cancel. Usually closes a dialog.",
        "action.copy": "Copy as in \"copy to clipboard\"",
        "action.decreaseOffsetButton": "Label for button that decreases subtitle timing offset.",
        "action.delete": "Button to delete a card from the user's mining history.",
        "action.save": "Button to save changes made in a dialog or settings page.",
        "action.preview": "Button to preview something before saving it.",
        "action.downloadAudio": "Button to download the audio that was recorded for a particular card.",
        "action.downloadImage": "Button to download the screenshot that was taken for a particular card.",
        "action.downloadSubtitlesAsSrt": "SRT, a subtitle file format.",
        "action.exportSettings": "Label for button that exports a settings file.",
        "action.hideOverlay": "Label for button that hides the streaming video overlay UI.",
        "action.importSettings": "Label for button that imports a settings file.",
        "action.increaseOffsetButton": "Label for button that increases subtitle timing offset.",
        "action.jumpTo": "\"Jump To\" refers to jumping to a specific subtitle in the asbplayer subtitle list.",
        "action.loadSubtitles": "Button label for action to load subtitles.",
        "action.mine": "Button label for the \"mine\" action.",
        "action.ok": "Button to confirm an action.",
        "action.openApp": "Opens the asbplayer app/website in a new tab.",
        "action.openFiles": "Button to open files.",
        "action.openSidePanel": "Opens the side panel.",
        "action.startRecording": "Label for button that starts an audio recording in preparation for an Anki card. This action is available when an empty subtitle track is loaded.",
        "action.stopRecording": "Label for button that stops an audio recording in preparation for an Anki card. This action is available when an empty subtitle track is loaded and the user has started an audio recording.",
        "action.updateLastCard": "Label for button that updates the last-created Anki card with asbplayer-supplied data such as media/images/text.",
        "activeTabPermissionRequest.grantedPrompt": "Body of text of popup displayed when user enables audio recording for the current tab.",
        "activeTabPermissionRequest.grantedTitle": "Title of popup displayed when user enables audio recording for the current tab.",
        "activeTabPermissionRequest.prompt": "Body text of popup displayed when user tries to record audio but audio recording is not enabled for the current tab.",
        "activeTabPermissionRequest.title": "Title of popup displayed when user tries to record audio but audio recording is not enabled for the current tab.",
        "ankiDialog.applySelection": "\"Selection\" refers to the selected time range using the slider at the bottom of the card creator.",
        "ankiDialog.audio": "Field label for the \"audio\" input field of the card creator.",
        "ankiDialog.audioFileLinkLost": "File link, or \"file reference.\" \"Page reload\" in the context of the browser.",
        "ankiDialog.cannotUpdateAudio": "Helper text that explains to the user that audio cannot be re-recorded because it has already been recorded once.",
        "ankiDialog.copyToClipboard": "Button to copy the screenshot to clipboard. ",
        "ankiDialog.definition": "Field label for the \"definition\" input field of the card creator.",
        "ankiDialog.export": "Button that creates a card in Anki with the contents of asbplayer's card creator.",
        "ankiDialog.foundDuplicateNotes": "When the user types a word into the card creator's \"word\" field, asbplayer will check the user's existing Anki card deck for a card that already has that word. If there is already a card that has the word, this text is displayed. \"Field\" is a technical term that refers to the name of a particular field in the Anki flashcard.",
        "ankiDialog.foundNoDuplicateNote": "When the user types a word into the card creator's \"word\" field, asbplayer will check the user's existing Anki card deck for a card that already has that word. If NO card exists with the given word, this text is displayed. \"Field\" is a technical term that refers to the name of a particular field in the Anki flashcard.",
        "ankiDialog.image": "Field label for the \"image\" input field of the card creator. ",
        "ankiDialog.imageFileLinkLost": "File link, or \"file reference.\" \"Page reload\" in the context of the browser.",
        "ankiDialog.openInAnki": "Button that opens  Anki's card creator with the contents of asbplayer's card creator.",
        "ankiDialog.rerecord": "Button to re-record audio.",
        "ankiDialog.resetSlider": "Button to reset the time-interval selector to it's initial state.",
        "ankiDialog.rewind": "Button that rewinds the video back to beginning of the subtitle that is currently in the card creator.",
        "ankiDialog.searchInAnki": "Button that queries the user's Anki deck for cards that already contain a particular word.",
        "ankiDialog.sentence": "Field label for the \"sentence\" input field of the card creator.",
        "ankiDialog.source": "Field label for the \"source\" input field of the card creator. In this case \"souce\" refers to wherever the sentence or subtitle was found. Often it will be the name of the subtitle file, but sometimes it will be the name of the video.",
        "ankiDialog.tagList": "Strings, or character sequences",
        "ankiDialog.title": "Popup title for asbplayer's card creator.",
        "ankiDialog.updateLastCard": "Button to update the last-created Anki card with the current contents of the card creator.",
        "ankiDialog.url": "Page URL of the video being mined with asbplayer.",
        "ankiDialog.word": "Field label for the \"word\" input field of the card creator.",
        "ankiDialog.zoomIn": "Button to zoom-in in on the time-interval selector.",
        "ankiDialog.zoomOut": "Button to zoom-out on the time-interval selector.",
        "audioCaptureFailed.message": "Helper text displayed indicating that audio capture failed due to audio stream being DRM protected.",
        "backgroundAudioRecordingPage.description": "For technical reasons, asbplayer requires a separate tab to be opened that is specifically used to record audio from streaming video. This text is what the user sees when they view that tab.",
        "bar.donate": "Button to donate. Takes the user to the page that lists different ways to donate money to me (https://github.com/killergerbah/asbplayer#supporters).",
        "bar.help": "Button that takes the user to the README where instructions on how to use asbplayer are written (https://github.com/killergerbah/asbplayer#usage).",
        "bar.miningHistory": "Button to open the user's mining history.",
        "bar.settings": "Button to open the settings dialog.",
        "bar.submitIssue": "Button to submit an issue. Takes the user to the issue tracker for asbplayer (https://github.com/killergerbah/asbplayer/issues).",
        "binds.adjustOffset": "Refers to the two keyboard shortcuts above as a category. This is the label for the toggle that enables/disables the above two shortcuts for the extension only.",
        "binds.adjustOffsetToNextSubtitle": "This keyboard shortcut adjust the subtitle timing so that the next subtitle appears at the current timestamp in the video i.e. the subtitle timing is sped up by a particular amount.",
        "binds.adjustOffsetToPreviousSubtitle": "Sometimes subtitle files do not match up in timing with the video they are loaded onto. In this case the subtitles need to be retimed by adjusting the subtitle offset e.g. adjusting the subtitle offset by +1 second means that subtitles will appear 1 second slower than their original timing. This keyboard shortcut adjust the subtitle timing so that the previous subtitle appears at the current timestamp in the video i.e. the subtitle timing is delayed by a particular amount.",
        "binds.adjustOffsetToSubtitle": "Refers to the two keyboard shortcuts above as a category. This is the label for the toggle that enables/disables the above two shortcuts for the extension only.",
        "binds.adjustPlaybackRate": "Refers to the two keyboard shortcuts above as a category. This is the label for the toggle that enables/disables the above two shortcuts for the extension only.",
        "binds.ankiExport": "Keyboard shortcut to mine the current subtitle, and open asbplayer's card creator.",
        "binds.copySubtitle": "Keyboard shortcut to mine the current subtitle. Does not open the card creator. However, the card creator for the mined subtitle can be opened from the mining history.",
        "binds.decreaseOffset": "Keyboard shortcut to speed up subtitles by 100ms.",
        "binds.decreasePlaybackRate": "Keyboard shortcut to decrease the playback rate by 0.1. E.g. if the video is playing at normal speed, decreases the speed to 0.9x. Using the shortcut again would increase the speed to 0.8x and so on.",
        "binds.extensionAnkiDialog": "Keyboard shortcut to mine the current subtitle and open the card creator when using the extension. In the case when an empty subtle track is loaded using the extension, this shortcut will start/stop an audio recording.",
        "binds.extensionCopySubtitle": "Keyboard shortcut to mine the current subtitle when using the extension. In the case when an empty subtle track is loaded using the extension, this shortcut will start/stop an audio recording.",
        "binds.extensionSelectSubtitleTrack": "Keyboard shortcut that opens the subtitle track selector for streaming video. The track selector may contain automatically-detected subtitle tracks, such as those that are available on Netflix or YouTube. The dialog also allows the user to manually open a file, or load an empty subtitle track.",
        "binds.extensionTakeScreenshot": "When creating cards using the extension, the extension will normally take a screenshot of the video at the beginning of the subtitle. This keyboard shortcut is provided to give the user an option to retake the screenshot at a position in the video that they desire, in case they don't like the screenshot that the extension automatically took for them. When this shortcut is used, the card creator is re-opened and will contain the manually-taken screenshot.",
        "binds.extensionToggleRecording": "When a non-empty subtitle file is loaded, normally a user cannot pick where an audio recording starts and stop (as opposed to when an empty subtitle file is loaded). This keyboard shortcut is provided in case the user wants to manually start/stop a recording, even when a non-empty subtitle file is loaded.",
        "binds.extensionUpdateLastCard": "Keyboard shortcut to update the last card in Anki with asbplayer-captured media, using the extension. In the case when an empty subtle track is loaded using the extension, this shortcut will start/stop an audio recording.",
        "binds.increaseOffset": "Keyboard shortcut to delay subtitles by 100ms.",
        "binds.increasePlaybackRate": "Keyboard shortcut to increase the playback rate by 0.1. E.g. if the video is playing at normal speed, increases the speed to 1.1x. Using the shortcut again would increase the speed to 1.2x and so on.",
        "binds.resetOffset": "Keyboard shortcut to reset subtitle offset to 0.",
        "binds.seekBackward": "Keyboard shortcut to seek backwards in the video.",
        "binds.seekBackwardOrForward": "Refers to the two keyboard shortcuts above as a category. This is the label for the toggle that enables/disables the above two shortcuts for the extension only.",
        "binds.seekForward": "Keyboard shortcut to seek forwards in the video.",
        "binds.seekToBeginningOfCurrentOrPreviousSubtitle": "Keyboard shortcut that seeks to beginning of the current subtitle, or the last subtitle if no subtitle is active.",
        "binds.seekToBeginningOfCurrentSubtitle": "Keyboard shortcut to seek to the beginning of the current subtitle.",
        "binds.seekToNextSubtitle": "Keyboard shortcut to seek to the beginning of the next subtitle.",
        "binds.seekToPreviousSubtitle": "Keyboard shortcut to seek to the beginning of the previous subtitle.",
        "binds.seekToSubtitle": "Refers to the two keyboard shortcuts above as a category. This is the label for the toggle that enables/disables the above two shortcuts for the extension only.",
        "binds.takeScreenshot": "Keyboard shortcut for manually taking a screenshot, overriding the screenshot taken for the last card.",
        "binds.toggleAsbplayerSubtitleTrack1": "In the case when multiple subtitle files are loaded, displays/hides subtitle track 1 in the asbplayer subtitle list (as opposed to the video).",
        "binds.toggleAsbplayerSubtitleTrack2": "In the case when multiple subtitle files are loaded, displays/hides subtitle track 2 in the asbplayer subtitle list (as opposed to the video).",
        "binds.toggleAsbplayerSubtitleTrack3": "Keyboard shortcut to toggle displaying subtitle track 3 in the subtitle list (either in asbplayer tab or in side panel).",
        "binds.toggleAsbplayerSubtitleTracks": "Refers to the two keyboard shortcuts above as a category. This is the label for the toggle that enables/disables the above two shortcuts for the extension only.",
        "binds.toggleAutoPause": "\"Auto-pause\" is a playback mode that pauses automatically either at the beginning or end of every subtitle, depending on the user's settings.",
        "binds.toggleCondensedPlayback": "\"Condensed playback\" is a playback mode that skips any sections of a media file not covered by a subtitle.",
        "binds.toggleFastForwardPlayback": "Keyboard shortcut to toggle fast-forward playback modee.",
        "binds.togglePlay": "Keyboard shortcut to play/pause video synced with asbplayer.",
        "binds.toggleRepeat": "Keyboard shortcut to toggle repeat playback mode. Repeat playback mode loops the current subtitle until it's turned off.",
        "binds.toggleSidePanel": "Keyboard shortcut to open/close the side panel.",
        "binds.toggleSubtitles": "\"Toggle\" in this case means switch display/hide.",
        "binds.toggleVideoSubtitleTrack1": "In the case when multiple subtitle files are loaded, displays/hides subtitle track 1 in the video (as opposed to the asbplayer subtitle list).",
        "binds.toggleVideoSubtitleTrack2": "In the case when multiple subtitle files are loaded, displays/hides subtitle track 2 in the video (as opposed to the asbplayer subtitle list).",
        "binds.toggleVideoSubtitleTrack3": "Keyboard shortcut to toggle displaying subtitle track 3 on video.",
        "binds.toggleVideoSubtitleTracks": "Refers to the two keyboard shortcuts above as a category. This is the label for the toggle that enables/disables the above two shortcuts for the extension only.",
        "binds.updateLastCard": "Keyboard shortcut to update the last-created card in Anki with data captured by asbplayer. Such data possibly includes: the subtitle, a screenshot, recorded audio. This shortcut is often used when the actual card is created via another program, and all that's needed from asbplayer is the image and screenshot.",
        "binds.markHoveredToken": "Keyboard shortcut to mark the currently hovered word as a known status locally.",
        "binds.toggleHoveredTokenIgnored": "Keyboard shortcut to toggle whether the currently hovered word is ignored for dictionary features.",
        "controls.condensedMode": "Label for button that enables condensed playback.",
        "controls.fastForwardMode": "Label for button that toggles fast-forward mode.",
        "controls.hideSubtitlePlayer": "Label for button that hides the subtitle list.",
        "controls.normalMode": "Label for button that enables normal playback.",
        "controls.playbackMode": "Label for button that opens menu of playback modes.",
        "controls.playbackRate": "Tooltip for the manual playback rate input field.",
        "controls.popIn": "Label for button in asbplayer website that pops the video back into the current tab.",
        "controls.popOut": "Label for button in asbplayer website that pops the video out into a separate window.",
        "controls.selectAudioTrack": "Label for button that opens audio track selector.",
        "controls.selectVideoElement": "Label for button in asbplayer website that opens video element selector. Selecting a video element syncs the currently-loaded subtitles onto the video element.",
        "controls.showSubtitlePlayer": "Label for button that shows the subtitle list.",
        "controls.subtitleAlignment": "Label for button that changes subtitle alignment (bottom/top).",
        "controls.subtitleOffset": "Tooltip label for the manual subtitle offset input field.",
        "controls.toggleFullscreen": "Label for button that toggles fullscreen mode.",
        "controls.toggleSubtitles": "Label for button that toggles subtitle display on video.",
        "controls.toggleTheaterMode": "Label for button that toggles theater mode (hides app bar).",
        "controls.unloadVideo": "Label for button that unloads the current video.",
        "copyHistory.blank": "Blank, as in a blank text field.",
        "copyHistory.downloadMinedSubsAsSrt": "Button to download the subtitles in a particular section of the mining history as an SRT file. ",
        "copyHistory.exportToAnki": "Button that opens asbplayer's card creator with a mined subtitle.",
        "copyHistory.miningHistoryEmpty": "Placeholder text that is shown in the mining history when mining history is empty.",
        "error.bothAudioAndVideNotAllowed": "Error displayed when user tries to open both an audio and video file at the same time.",
        "error.failedToLoadDirectory": "Error displays when asbplayer fails to load a directory of files. The reason for the error is not necessarily known.",
        "error.lostTabConnection": "Error that is displayed when asbplayer loses connection with a streaming video element. For example, this error is displayed when the user closes the tab with the video element that asbplayer is synced to.",
        "error.onlyOneAudioFile": "Error displayed when user tries to open more than one audio file.",
        "error.onlyOneDirectoryAllowed": "Error displayed when a user tries to open more than one directory.",
        "error.onlyOneVideoFile": "Error displayed when user tries to open more than one video file.",
        "error.subdirectoriesNotAllowed": "Error displayed when user tries to load a directory that itself contains subdirectories.",
        "error.subtitleFileNotOpen": "Error displayed when user tries to do something that requires a particular subtitle file to be open. For example, this error is displayed if the uses the \"Jump To\" button on a subtitle in the mining history, and the subtitle file that subtitle was mined from is not open.",
        "error.unknownExtension": "Extension as in \"file extension.\"",
        "error.unsupportedExtension": "Error displayed when user tries to open a file with an extension not supported by asbplayer.",
        "error.videoPlayerDragAndDropNotAllowed": "Error displayed when user tries to drag-and-drop a file into the frame of a video loaded directly into asbplayer. ",
        "extension.settings.asbplayerUrl": "Setting for the URL of the asbplayer website.",
        "extension.settings.autoLoadDetectedSubs": "When this setting is enabled, asbplayer will automatically load subtitles it detects. This is only supported on specific websites where asbplayer knows how to detect subtitles, such as Netflix and YouTube.",
        "extension.settings.cleanScreenshot": "When this setting is enabled, any foreground elements that may be covering the video are hidden before the screenshot is taken. When this setting is disabled, elements not related to the contents of the video, such as video controls, will remain in the screenshot.",
        "extension.settings.condensedPlaybackMinSkipInterval": "\"Condensed playback\" is a playback mode that skips any time interval that is not covered by a subtitle. This allows users to view a video and skip any parts without dialog for efficient listening practice. The \"minimum skip interval\" controls how much time needs to be between subtitles before asbplayer will try to skip it. For example, if the minimum skip interval is 0, asbplayer will ALWAYS skip the intervals between subtitles, which could cauuse conversations between characters to feel choppy.",
        "extension.settings.cropScreenshot": "When this setting is enabled, the screenshot is cropped so that only the contents of the video element are in the screenshot. When this setting is disabled, the screenshot will be of the entire page.",
        "extension.settings.displaySubtitles": "Setting that displays/hides subtitle.",
        "extension.settings.dragAndDrop": "When this setting is enabled, users can sync a video with asbplayer by dragging-and-dropping a subtitle file into the video.",
        "extension.settings.enableOverlay": "Setting that indicates whether streaming video overlay UI should be enabled.",
        "extension.settings.mining": "Section heading for mining-related settings.",
        "extension.settings.miningKeyboardShortcuts": "Section heading for keyboard shortcuts related to mining.",
        "extension.settings.misc": "Section heading for misc settings.",
        "extension.settings.openSubtitleList": "Setting that indicates whether the subtitle list should be opened in a separate tab every time subtitles are loaded into a streaming video.",
        "extension.settings.playback": "Section heading for playback-related settings.",
        "extension.settings.playbackKeyboardShortcuts": "Section heading for keyboard shortcuts related to playback.",
        "extension.settings.recordAudio": "When this setting is enabled, audio is recorded when mining a subtitle.",
        "extension.settings.screenshotCaptureDelay": "How long asbplayer waits after a mining command is issued to take a screenshot. If negative, asbplayer will count delay from the end of the subtitle instead of the beginning.",
        "extension.settings.subtitlePositionOffset": "Setting for subtitles' distance from the bottom OR top of a video element.",
        "extension.settings.subtitles": "Section heading for subtitles-related settings such as subtitle display and position. ",
        "extension.settings.syncing": "Section heading for settings related to syncing asbplayer with streaming video.",
        "extension.settings.takeScreenshot": "When this setting is enabled, a screenshot is taken when mining a subtitle.",
        "extension.settings.updateAvailable": "Label for button that is shown when an extension update is available. When this button is clicked, the user is taken to a page with information about the latest version of the extension.",
        "extension.subtitles.subtitleAlignment": "Setting that determines which edge of the video element to align subtitles to (e.g. top or bottom).",
        "extension.subtitles.subtitleAlignmentBottom": "Option to align subtitles to the bottom of the video element.",
        "extension.subtitles.subtitleAlignmentTop": "Option to align subtitles to the top of the video element.",
        "extension.videoDataSync.emptySubtitleTrack": "List item label in the subtitle track selector for the 'empty' subtitle track.",
        "extension.videoDataSync.loadSubtitlesFirst": "Text that is shown when the user tries to use a mining command, but no subtitles are loaded. ",
        "extension.videoDataSync.rememberTrackPreference": "Checkbox label in subtitle track selector for whether asbplayer should save the language of the subtitle track selection as the 'preferred' language. The preferred language is used when automatically loading auto-detected subtitles or when automatically selecting the default selection in the subtitle track selector.",
        "extension.videoDataSync.selectSubtitles": "Title for popup that allows user to select subtitles to load. The popup may contain subtitle tracks that are automatically detected. The same popup also allows the user to manually open a file, or load an empty subtitle track.",
        "extension.videoDataSync.subtitleTrack": "Label for subtitle track selector dropdown.",
        "extension.videoDataSync.videoName": "Label for field where user inputs the name of the video they want to mine.",
        "extension.videoSelect.multipleVideoElements": "Title for popup shown when the user tries to open the subtitle track selector, but there are multiple video elements on the screen. This popup allows the user to pick what video element to sync to asbplayer. The \"element\" in \"video element\" refers to an HTML element, a technical term for a particular piece or \"element\" of the webpage.\nextension.videoSelect.selectVideo,Explanation text for the popup described above.",
        "extension.videoSelect.syncBeforeMine": "Explanation text for the popup described above.",
        "extension.videoSelect.videoElement": "Field label for video element selector dropdown.",
        "ftue.welcome": "Text that is displayed when user installs asbplayer for the first time.",
        "ftue.welcomeBody": "Text that is displayed when user installs asbplayer for the first time.",
        "info.connectionFailed": "Helper text in settings dialog indicating WebSocket connection failed.",
        "info.connectionSucceeded": "Helper text in settings dialog indicating WebSocket connection succeeded.",
        "info.copiedSubtitle": "Text that is displayed when asbplayer mines a subtitle.",
        "info.copiedSubtitle2": "Notification displayed when user copies/mines a subtitle.",
        "info.disabledAutoPause": "Displayed when user toggles off auto-pause playback mode.",
        "info.disabledCondensedPlayback": "Displayed when user toggles off condensed playback mode.",
        "info.disabledFastForwardPlayback": "Notification displayed when user disables fast-forward playback.",
        "info.disabledRepeatPlayback": "Notification displayed when user disables repeat playback mode.",
        "info.enabledAutoPause": "Displayed when user toggles on auto-pause playback mode.",
        "info.enabledCondensedPlayback": "Displayed when user toggles on condensed playback mode.",
        "info.enabledFastForwardPlayback": "Notification displayed when user enables fast-forward playback.",
        "info.enabledRepeatPlayback": "Notification displayed when user enables repeat playback mode.",
        "info.error": "Displayed when an error occurs.",
        "info.errorNoMessage": "Displayed when an error occurs, without specifying the actual error.",
        "info.exportedCard": "Displayed when asbplayer successfully creates a card. The 'resulut' may be arbitrary text.",
        "info.playbackRate": "Notification displayed when user changes video playback rate.",
        "info.savedTimestamp": "This is the text that is displayed when no subtitle file, or a empty subtitle file is loaded, and the user issues a mining command. ",
        "info.toggleSubtitlesShortcut": "Helper notification that tells user how to toggle subtitle display on.",
        "info.updatedCard": "Displayed when asbplayer successfully updates an already-created card. The 'resulut' may be arbitrary text.",
        "landing.cta": "Call-to-action that the user sees when they first load the abplayer website. \"Browse\" is intended to be shorthand for \"open the file browser and select file(s) to load.\"",
        "landing.extensionNotInstalled": "Second line that appears if the user has not installed the Chrome extension.",
        "landing.extensionUpdateAvailable": "Line that appears on the website if a new version of the extension has been released.",
        "landing.noSubtitles": "Text displayed in subtitle list when an empty subtitle track is loaded.",
        "landing.noVideoElementsDetected": "Text displayed in side panel when no video elements are detected in the current page.",
        "landing.videoElementsDetected": "Text displayed in side panel when video elements are detected in the current page.",
        "postMineAction.exportCard": "Setting that indicates after using a UI button to mine, export a card with the captured media/context.",
        "postMineAction.none": "Setting that indicates after using a UI button to mine, do nothing. The card will be saved to mining history, but nothing else will happen.",
        "postMineAction.showAnkiDialog": "Setting that indicates after using a UI button to mine, show the Anki dialog.",
        "postMineAction.updateLastCard": "Setting that indicates after using a UI button to mine, update the last card with the captured media/context.",
        "postMinePlayback.pause": "Setting that indicates after mining, always pause the video.",
        "postMinePlayback.play": "Setting that indicates after mining, always play the video.",
        "postMinePlayback.remember": "Setting that indicates after mining, restore playback state (playing/paused) from prior to mining.",
        "settings.addCustomCss": "Label for setting button for adding a custom CSS style to subtitles.",
        "settings.addCustomField": "\"Field\" refers to an Anki card field.",
        "settings.alwaysPlayOnSubtitleRepeat": "Label for setting that indicates whether asbplayer should always automatically play (i.e. unpause if paused) after using the shortcut which seeks to the beginning of the current or last subtitle.",
        "settings.anki": "Section heading for Anki-related settings.",
        "settings.ankiConnectUrl": "The URL that is used to contact Anki Connect. Anki Connect is an Anki add-on that allows asbplayer to communicate with Anki to create and manipulate flashcards.",
        "settings.audioField": "The field of the Anki card that will be populated with audio extracted from the video.",
        "settings.audioPaddingEnd": "How much padding to add to the end of audio recordings. E.g. if the \"padding end\" is 1 second, then the audio recording for a particular subtitle will continue for 1 second after the subtitle ends.",
        "settings.audioPaddingStart": "How much padding to add to the beginning of audio recordings. E.g. if the \"padding start\" is 1 second, then the audio recording for a particular subtitle will start 1 second before that subtitle actually starts.",
        "settings.autoCopy": "If this setting is enabled, any time a new subtitle appears it is copied to clipboard.",
        "settings.autoPauseAtSubtitleEnd": "If this option is chosen, asbplayer will pause at the end of every subtitle when the auto-pause playback mode is on.",
        "settings.autoPauseAtSubtitleStart": "If this option is chosen, asbplayer will pause at the beginning of every subtitle when the auto-pause playback mode is on.",
        "settings.autoPausePreference": "Whether to pause at the start or end of a subtitle.",
        "settings.autoPausePreferenceHelperText": "Supplementary text explaining the \"auto-pause preference.\"",
        "settings.clickToMineDefaultAction": "Label for setting that controls the default mining action when using the 'mine' button.",
        "settings.copyOnMine": "Setting that causes the mined subtitle to be copied to clipboard anytime the user issues a mining command.",
        "settings.corsHelperText": "\"webCorsOriginList\" is the specific name of a piece of data that should not be translated. ",
        "settings.customCssField": "Label for menu of CSS styles when adding a custom CSS style.",
        "settings.deck": "Deck refers to an Anki deck (of flashcards).",
        "settings.definitionField": "The field of the Anki card that will be populated with the definition.",
        "settings.annotationLocalAnkiHelperText": "Helper text that explains how local known status annotation works.",
        "settings.buildAnkiCache": "Trigger a manual rebuild of the Anki cache used for dictionary features.",
        "settings.dictionaryTrack": "Choice of subtitle track that dictionary features will be applied to.",
        "settings.dictionaryColorizeSubtitles": "Whether to colorize subtitle words based on known status.",
        "settings.dictionaryColorizeOnHoverOnly": "Whether to only colorize subtitle words when hovering over them with the mouse.",
        "settings.dictionaryHighlightOnHover": "Whether to highlight subtitle words when hovering over them with the mouse.",
        "settings.dictionaryTokenMatchStrategy": "The strategy used to match subtitle words for known status.",
        "settings.dictionaryTokenMatchStrategyAnyFormCollected": "Match if any form of the word is collected.",
        "settings.dictionaryTokenMatchStrategyLemmaOrExactFormCollected": "Match if the lemma or exact form of the word is collected.",
        "settings.dictionaryTokenMatchStrategyLemmaFormCollected": "Match if the lemma form of the word is collected.",
        "settings.dictionaryTokenMatchStrategyExactFormCollected": "Match if the exact form of the word is collected.",
        "settings.dictionaryTokenMatchStrategyPriority": "How tie-breakers are handled when a match strategy indicate different known statuses for a word.",
        "settings.dictionaryTokenMatchStrategyPriorityExact": "Give priority to exact form matches when there is a tie.",
        "settings.dictionaryTokenMatchStrategyPriorityLemma": "Give priority to lemma form matches when there is a tie.",
        "settings.dictionaryTokenMatchStrategyPriorityBestKnown": "Give priority to the best known status when there is a tie.",
        "settings.dictionaryTokenMatchStrategyPriorityLeastKnown": "Give priority to the worst known status when there is a tie.",
        "settings.dictionaryYomitanUrl": "The URL to the yomitan-api server.",
        "settings.dictionaryYomitanScanLength": "The maximum number of characters to scan for a single token. Lower is faster but may miss longer compound words.",
        "settings.dictionaryTokenReadingAnnotation": "When to show reading annotations for subtitle words based on known status.",
        "settings.dictionaryTokenReadingAnnotationAlways": "Always show reading annotations for subtitle words.",
        "settings.dictionaryTokenReadingAnnotationLearningOrBelow": "Only show reading annotations for subtitle words in learning status or below.",
        "settings.dictionaryTokenReadingAnnotationUnknownOrBelow": "Only show reading annotations for subtitle words in unknown status or below.",
        "settings.dictionaryTokenReadingAnnotationNever": "Never show reading annotations for subtitle words.",
        "settings.dictionaryDisplayIgnoredTokenReadings": "Whether to display reading annotations for ignored words.",
        "settings.dictionaryTokenFrequencyAnnotation": "When to show frequency annotations for subtitle words based on known status.",
        "settings.dictionaryTokenFrequencyAnnotationAlways": "Always show frequency annotations for subtitle words.",
        "settings.dictionaryTokenFrequencyAnnotationUncollectedOnly": "Only show frequency annotations for subtitle words in uncollected status.",
        "settings.dictionaryTokenFrequencyAnnotationNever": "Never show frequency annotations for subtitle words.",
        "settings.dictionaryAnkiDecks": "A list of Anki decks to use for dictionary features.",
        "settings.dictionaryAnkiSelectDecks": "Placeholder label for selecting Anki decks for dictionary features.",
        "settings.dictionaryAnkiWordFields": "A list of Anki card word fields to match subtitle words against for known status.",
        "settings.dictionaryAnkiSentenceFields": "A list of Anki card sentence fields to match subtitle words inside of for known status.",
        "settings.dictionaryAnkiSelectFields": "Placeholder label for selecting Anki fields for dictionary features.",
        "settings.dictionaryAnkiSentenceTokenMatchStrategy": "The strategy used to match subtitle words in Anki card sentence fields for known status.",
        "settings.dictionaryAnkiMatureCutoff": "The Anki stability/interval (in days) after which a word is considered fully known.",
        "settings.dictionaryAnkiTreatSuspended": "How to treat suspended cards when determining known status of words.",
        "settings.dictionaryAnkiTreatSuspendedNormal": "Option to treat suspended cards as normal",
        "settings.dictionaryTokenStylingSection": "Section heading for settings related to styling tokens based on known status.",
        "settings.dictionaryTokenStyling": "What styling is applied to the tokens to be colored based on known status.",
        "settings.dictionaryTokenStylingText": "Option to color the text of tokens based on known status.",
        "settings.dictionaryTokenStylingBackground": "Option to color the background of tokens based on known status.",
        "settings.dictionaryTokenStylingUnderline": "Option to underline tokens with a color based on known status.",
        "settings.dictionaryTokenStylingOverline": "Option to overline tokens with a color based on known status.",
        "settings.dictionaryTokenStylingOutline": "Option to outline tokens with a color based on known status.",
        "settings.dictionaryTokenStylingThickness": "Thickness of the underline/overline/outline applied to tokens when using dictionary token styling.",
        "settings.dictionaryTokenStylingThicknessHelperText": "Helper text for dictionary token styling thickness setting.",
        "settings.dictionaryColorizeFullyKnownTokens": "If this setting is enabled, tokens that are \"fully known\" will be colorized.",
        "settings.dictionaryTokenStatus5": "Color used to indicate that a word is \"mature.\"",
        "settings.dictionaryTokenStatus4": "Color used to indicate that a word is \"young.\"",
        "settings.dictionaryTokenStatus3": "Color used to indicate that a word is \"graduated.\"",
        "settings.dictionaryTokenStatus2": "Color used to indicate that a word is \"learning.\"",
        "settings.dictionaryTokenStatus1": "Color used to indicate that a word is \"unknown.\"",
        "settings.dictionaryTokenStatus0": "Color used to indicate that a word is \"uncollected.\"",
        "settings.dictionaryImportClipboardText": "Label for text area where user pastes known words to import from clipboard.",
        "settings.dictionaryImportClipboardNoTokens": "Helper text shown when no tokens are found in the clipboard import text area.",
        "settings.extensionOverriddenBind": "Text that is shown when a the keyboard shortcut is overridden by the extension. This situation is possible because the extension has its own keyboard shortcut settings which may override the website's keyboard shortcut settings.",
        "settings.extensionShortcut": "Helper text that indicates a particular shortcut is defined through extension settings, and not through the website.",
        "settings.fastForwardModePlaybackRate": "Label for setting that controls how fast to fast-forward in fast-forward mode.",
        "settings.firefoxExtensionShortcutHelp": "Helper text that explains how to edit Firefox extension shortcuts.",
        "settings.imageBasedSubtitleScaleFactor": "Setting that scales the size of image-based subtitles e.g. 2 = 2x the default size.",
        "settings.imageField": "The field of the Anki card that will be populated with image extracted from the video.",
        "settings.keyboardShortcuts": "Section heading for keyboard shortcut settings.",
        "settings.language": "Section heading for the \"language\" setting.",
        "settings.maxImageHeight": "Setting to constrain the height of screenshots taken with asbplayer.",
        "settings.maxImageWidth": "Setting to constrain the width of an screenshots taken with asbplayer.",
        "settings.mining": "Section heading for settings related to mining.",
        "settings.miningHistoryStorageLimit": "The maximum number of cards in the user's mining history that will be preserved across asbplayer page reloads.",
        "settings.misc": "Section heading for misc settings.",
        "settings.mp3Preference": "Setting to re-encode the audio-recordings as an mp3 before creating a card in Anki. If this setting is disabled, audio would be sent to Anki in a different format.",
        "settings.noteType": "Anki note type.",
        "settings.postMinePlayback": "Label for setting that controls video playback state following a mining action.",
        "settings.postMiningPlaybackState": "Label for setting that controls video playback state following a mining action.",
        "settings.preCacheSubtitleDom": "Label for setting that determines whether to pre-cache subtitle DOM.",
        "settings.preCacheSubtitleDomHelperText": "Helper text explaining what the 'pre-cache subtitle DOM' setting does.",
        "settings.recordingBind": "Text that is shown when the user is defining a new keyboard shortcut, and asbplayer is \"recording\" the key presses of the user.",
        "settings.recordWithAudioPlayback": "When recording audio, should there be audio playback. If this setting is disabled, audio recording will be silent.",
        "settings.rememberSubtitleOffset": "If this setting is enabled, the currently-applied subtitle offset will be retained even if a new subtitle file is loaded.",
        "settings.sentenceField": "The field of the Anki card that will be populated with the sentence, or subtitle.",
        "settings.sourceField": "The field of the Anki card that will be populated with the \"source\" of the sentence. This is usually the subtitle file, but could be the video name, or an arbitrary string provided by the user.",
        "settings.streamingVideo": "Streaming video' settings category.",
        "settings.styleKey": "Placeholder text when selecting a custom CSS style key.",
        "settings.styleValue": "Placeholder text for text field for custom CSS style value.",
        "settings.subtitleAlignment": "Label for setting that controls subtitle alignment.",
        "settings.subtitleAlignmentBottom": "Label for settings value that sets subtitle alignment to 'bottom.'",
        "settings.subtitleAlignmentTop": "Label for settings value that sets subtitle alignment to 'top.'",
        "settings.subtitleAppearance": "Section heading for settings related to subtitle appearance.",
        "settings.subtitleBackgroundColor": "Setting that controls the background color of the subtitle.",
        "settings.subtitleBackgroundOpacity": "Setting that controls the opacity of the background of the subtitle.",
        "settings.subtitleColor": "Setting that controls subtitle color.",
        "settings.subtitleFontFamily": "Setting that controls the font family of the subtitle.",
        "settings.subtitleHtml": "Label for setting that controls subtitle HTML.",
        "settings.subtitleHtmlRemove": "If this option is chosen, all HTML tags will be removed from the subtitle text.",
        "settings.subtitleHtmlRender": "If this option is chosen, the HTML found in subtitles will be rendered.",
        "settings.subtitleOutlineColor": "Setting that controls the outline color of the subtitle.",
        "settings.subtitleOutlineThickness": "Setting that controls the outline thickness in pixels of the subtitle.",
        "settings.subtitleOutlineThicknessHelperText": "Helper text for subtitle outline thickness setting.",
        "settings.subtitlePositionOffset": "Label for setting that controls subtitle position offset.",
        "settings.subtitleRegexFilter": "This setting defines a regular expression used to filter text of a subtitle file.",
        "settings.subtitleRegexFilterTextReplacement": "This setting defines the text with which to replace strings matched by the above regular expression.",
        "settings.subtitleShadowColor": "Label for setting that controls subtitle shadow color.",
        "settings.subtitleShadowThickness": "Label for setting that controls subtitle shadow thickness.",
        "settings.subtitleSize": "Setting that controls subtitle size.",
        "settings.subtitleThickness": "Label for setting that controls thickness of subtitle text.",
        "settings.surroundingSubtitlesCountRadius": "\"Surrounding Subtitles\" refers to the subtitles that appear on the slider at the bottom of asbplayer's card creator. They are the subtitles that \"surround\" the subtitle being mined, and function as guides to help the user adjust their card. This setting sets a limit on the number of subtitles that can appear on that slider by setting the maximum number of subtitles (\"count radius\") those surrounding subtitles can be from the mined subtitle. Note the word \"radius\" is used loosely to mean \"distance from center\" i.e. \"distance from the target subtitle.\"",
        "settings.surroundingSubtitlesTimeRadius": "\"Surrounding Subtitles\" refers to the subtitles that appear on the slider at the bottom of asbplayer's card creator. They are the subtitles that \"surround\" the subtitle being mined, and function as guides to help the user adjust their card. This setting sets a limit on the number of subtitles that can appear on that slider by setting the maximum time interval (\"time radius\") those surrounding subtitles can be from the mined subtitle. Note the word \"radius\" is used loosely to mean \"distance from center\" i.e. \"distance from target subtitle\" in units of time.",
        "settings.tabName": "Label for setting that controls asbplayer website tab name.",
        "settings.tags": "Anki tags.",
        "settings.tagsHelperText": "Helper text for the \"tags\" settings field.",
        "settings.theme": "Section heading for the theme setting.",
        "settings.themeDark": "If this option is chosen, a dark color theme will be used to display asbplayer UI.",
        "settings.themeLight": "If this option is chosen, a light color theme will be used to display asbplayer UI.",
        "settings.title": "Title for settings dialog.",
        "settings.unboundBind": "Text that is shown when a keyboard shortcut is unbound i.e. not set.",
        "settings.unlockLocalFonts": "Label for button that unlocks the font family selector.",
        "settings.urlField": "The field of the Anki card that will be populated with the URL where the subtitle was mined.",
        "settings.webSocketClientEnabled": "Label for setting that enables asbplayer's websocket client.",
        "settings.webSocketServerUrl": "Label for setting that determines websocket server to connect to.",
        "settings.wordField": "The field of the Anki card that will be populated with the word.",
        "subtitlePlayer.multiSubtitleSelectHelp": "Tooltip text that explains how to select adjacent subtitles from subtitle list for mining. ",
        "update.alert": "Text that is displayed when asbplayer is updated.",
        "update.body": "Text that is displayed when asbplayer is updated.",
        "update.heading": "Text that is displayed when asbplayer is updated."
    },
    "extension": {
        "extensionDescription.message": "Description displayed for extension in browser's extension manager.",
        "shortcutMineSubtitleAndOpenDialogDescription.message": "Keyboard shortcut to mine the current subtitle and open the card creator when using the extension. In the case when an empty subtle track is loaded using the extension, this shortcut will start/stop an audio recording.",
        "shortcutMineSubtitleDescription.message": "Keyboard shortcut to mine the current subtitle when using the extension. In the case when an empty subtle track is loaded using the extension, this shortcut will start/stop an audio recording.",
        "shortcutSelectSubtitleTrackDescription.message": "Keyboard shortcut that opens the subtitle track selector for streaming video. The track selector may contain automatically-detected subtitle tracks, such as those that are available on Netflix or YouTube. The dialog also allows the user to manually open a file, or load an empty subtitle track.",
        "shortcutTakeScreenshotDescription.message": "When creating cards using the extension, the extension will normally take a screenshot of the video at the beginning of the subtitle. This keyboard shortcut is provided to give the user an option to retake the screenshot at a position in the video that they desire, in case they don't like the screenshot that the extension automatically took for them. When this shortcut is used, the card creator is re-opened and will contain the manually-taken screenshot.",
        "shortcutToggleRecordingDescription.message": "When a non-empty subtitle file is loaded, normally a user cannot pick where an audio recording starts and stop (as opposed to when an empty subtitle file is loaded). This keyboard shortcut is provided in case the user wants to manually start/stop a recording, even when a non-empty subtitle file is loaded.",
        "shortcutUpdateLastCardDescription.message": "Keyboard shortcut to update the last card in Anki with asbplayer-captured media, using the extension. In the case when an empty subtle track is loaded using the extension, this shortcut will start/stop an audio recording.",
        "contextMenuLoadSubtitles.message": "Label for context menu item that opens the subtitle track selector.",
        "contextMenuMineSubtitle.message": "Label for context menu item that mines the current subtitle.\ncontrols.autoPauseMode,Label for button that enables auto-pause playback mode."
    }
}